mistyk/inavradar-ESP32/src/main.cpp
        display.setTextAlignment(TEXT_ALIGN_RIGHT);
        display.drawString (111, 0, String(stats.last_tx_duration));
        display.drawString (111, 10, String(stats.last_msp_tx_duration));
        display.drawString (111, 20, String(stats.last_msp_rx_duration));
        display.drawString (111, 30, String(stats.last_oled_duration));
        display.drawString (111, 40, String(stats.last_rx_duration));
        display.drawString (111, 50, String(cfg.lora_cycle));


    }
    else if (sys_display_page >= 3) {

        int i = constrain(sys_display_page + 1 - LORA_NODES, 0, LORA_NODES - 1);
        bool iscurrent = (i + 1 == curr.id);

        display.setFont(ArialMT_Plain_24);
        display.setTextAlignment (TEXT_ALIGN_LEFT);
        display.drawString (0, 0, String(peer_slotname[i + 1]));

        display.setFont(ArialMT_Plain_16);
        display.setTextAlignment(TEXT_ALIGN_RIGHT);

        if (iscurrent) {
           display.drawString (128, 0, String(curr.name));
        }
        else {
            display.drawString (128, 0, String(peers[i].name));
        }

        display.setTextAlignment (TEXT_ALIGN_LEFT);
        display.setFont (ArialMT_Plain_10);

        if (peers[i].id > 0 || iscurrent) {

            if (peers[i].state == 2 && !iscurrent) { display.drawString (19, 0, "LOST"); }
                else if (peers[i].lq == 0 && !iscurrent) { display.drawString (19, 0, "x"); }
                else if (peers[i].lq == 1) { display.drawXbm(19, 2, 8, 8, icon_lq_1); }
                else if (peers[i].lq == 2) { display.drawXbm(19, 2, 8, 8, icon_lq_2); }
                else if (peers[i].lq == 3) { display.drawXbm(19, 2, 8, 8, icon_lq_3); }
                else if (peers[i].lq == 4) { display.drawXbm(19, 2, 8, 8, icon_lq_4); }

                if (iscurrent) {
                    display.drawString (19, 0, "<HOST>");
                    display.drawString (19, 12, String(host_name[curr.host]));
                }
                else {
                    if (peers[i].state != 2) {
                        display.drawString (38, 0, String(peers[i].rssi) + "db");
                    }
                    display.drawString (19, 12, String(host_name[peers[i].host]));
                }

                if (iscurrent) {
                    display.drawString (50, 12, String(host_state[curr.state]));
                }
                else {
                    display.drawString (50, 12, String(host_state[peers[i].state]));
                }

                display.setTextAlignment (TEXT_ALIGN_RIGHT);

                if (iscurrent) {
                    display.drawString (128, 24, "LA " + String((float)curr.gps.lat / 10000000, 6));
                    display.drawString (128, 34, "LO "+ String((float)curr.gps.lon / 10000000, 6));
                }
                else {
                    display.drawString (128, 24, "LA " + String((float)peers[i].gpsrec.lat / 10000000, 6));
                    display.drawString (128, 34, "LO "+ String((float)peers[i].gpsrec.lon / 10000000, 6));
                }

                display.setTextAlignment (TEXT_ALIGN_LEFT);

                if (iscurrent) {
                    display.drawString (0, 24, "A " + String(curr.gps.alt) + "m");
                    display.drawString (0, 34, "S " + String(peers[i].gpsrec.groundSpeed) + "m/s");
                    display.drawString (0, 44, "C " + String(curr.gps.groundCourse / 10) + "°");
                }
                else {
                    display.drawString (0, 24, "A " + String(peers[i].gpsrec.alt) + "m");
                    display.drawString (0, 34, "S " + String(peers[i].gpsrec.groundSpeed) + "m/s");
                    display.drawString (0, 44, "C " + String(peers[i].gpsrec.groundCourse / 10) + "°");
                }

                if (peers[i].gpsrec.lat != 0 && peers[i].gpsrec.lon != 0 && curr.gps.lat != 0 && curr.gps.lon != 0 && !iscurrent) {
                    peers[i].distance = distanceEarth(curr.gps.lat / 10000000, curr.gps.lon / 10000000, peers[i].gpsrec.lat / 10000000, peers[i].gpsrec.lon / 10000000);
                    peers[i].direction = 0;
                    peers[i].relalt = peers[i].gpsrec.alt - curr.gps.alt;
                }
                else {
                    peers[i].distance = 0;
                    peers[i].direction = 0;
                    peers[i].relalt = 0;
                }

                display.drawString (40, 44, "B " + String(peers[i].direction) + "°");
                display.drawString (88, 44, "D " + String(peers[i].distance) + "m");
                display.drawString (0, 54, "R " + String(peers[i].relalt) + "m");
                if (iscurrent) {
                    display.drawString (40, 54, String((float)curr.fcanalog.vbat / 10) + "v");
                    display.drawString (88, 54, String((int)curr.fcanalog.mAhDrawn) + "mah");
                }

                display.setTextAlignment (TEXT_ALIGN_RIGHT);

            }
        else {
            display.drawString (35, 7, "SLOT IS EMPTY");
        }

    }

    last_received_id = 0;
    sys_message[0] = 0;
    display.display();
}

// -------- MSP and FC


void msp_set_state() {
    uint32_t planeModes;
    msp.getActiveModes(&planeModes);
    curr.state = bitRead(planeModes, 0);
}

void msp_set_name() {
    msp.request(MSP_NAME, &curr.name, sizeof(curr.name));
}

void msp_set_fc() {
    char j[5];
    msp.request(MSP_FC_VARIANT, &j, sizeof(j));

    if (strncmp(j, "INAV", 4) == 0) {
        curr.host = HOST_INAV;
    }
    else if (strncmp(j, "BTFL", 4) == 0) {
        curr.host = HOST_BTFL;
    }
    else {
        curr.host = HOST_NONE;
    }
 }

 void msp_set_fcanalog() {
  msp.request(MSP_ANALOG, &curr.fcanalog, sizeof(curr.fcanalog));
}

void msp_send_peers() {
    msp_radar_pos_t radarPos;
    for (int i = 0; i < LORA_NODES; i++) {
        if (peers[i].id > 0) {
            radarPos.id = i;
            radarPos.state = peers[i].state;
            radarPos.lat = peers[i].gps.lat;
            radarPos.lon = peers[i].gps.lon;
            radarPos.alt = peers[i].gps.alt;
            radarPos.heading = peers[i].gps.groundCourse;
            radarPos.speed = peers[i].gps.groundSpeed;
            radarPos.lq = peers[i].lq;
            msp.command(MSP_SET_RADAR_POS, &radarPos, sizeof(radarPos));
        }
    }
}

// -------- INTERRUPTS

