mistyk/inavradar-ESP32/src/main.cpp
        LoRa.sleep();
        LoRa.receive();
        main_mode = MODE_LORA_RX;
    }

// ---------------------- DISPLAY

    if ((millis() > display_updated + cfg.cycle_display) && display_enabled && (main_mode > MODE_LORA_SYNC)) {

        stats.timer_begin = millis();
        display_draw();
        stats.timer_end = millis();
        stats.last_oled_duration = stats.timer_end - stats.timer_begin;
        display_updated = millis();
    }

// ---------------------- SERIAL / MSP


    if (((millis() > msp_next_cycle) && (msp_step < 3) && (curr.host != HOST_NONE)) && (main_mode > MODE_LORA_SYNC)) {

        stats.timer_begin = millis();

        switch (msp_step) {

        case 0: // Between TX slots 0 and 1

            if (sys_lora_sent % 8 == 0) {
                msp_set_fcanalog();
                stats.timer_end = millis();
                stats.last_msp_rx_duration = stats.timer_end - stats.timer_begin;
            }
            break;

        case 1: // Between TX slots 1 and 2
            msp_set_state();
            stats.last_msp_rx_duration = millis()- stats.timer_begin;
            break;

        case 2: // Between TX slots 2 and 3
            msp.request(MSP_RAW_GPS, &curr.gps, sizeof(curr.gps));
            stats.last_msp_rx_duration = millis() - stats.timer_begin;
            break;

        case 3: // Between TX slots 3 and 0
            if (curr.host == HOST_INAV) {
                msp_send_peers();
                stats.last_msp_tx_duration = millis() - stats.timer_begin;
            }
            break;

        }

        msp_next_cycle += cfg.lora_slot_spacing;
        msp_step++;
    }


// ---------------------- STATISTICS & IO

    if ((millis() > (cfg.cycle_stats + stats_updated)) && (main_mode > MODE_LORA_SYNC)) {

        sys_pps = sys_ppsc;
        sys_ppsc = 0;
        now = millis();

        // Pausing the timed-out peers + LQ computation

        for (int i = 0; i < LORA_NODES; i++) {

            if (now > (peers[i].lq_updated +  cfg.lora_cycle * 4)) {
                uint16_t diff = peers[i].updated - peers[i].lq_updated;
                peers[i].lq = constrain(peers[i].lq_tick * 4.4 * cfg.lora_cycle / diff, 0, 4);
                peers[i].lq_updated = now;
                peers[i].lq_tick = 0;
            }

            if (peers[i].id > 0 && ((now - peers[i].updated) > cfg.lora_peer_timeout)) {
                peers[i].state = 2;
                // peers[i].id = 0;
                sys_rssi = 0;
            }

        }

        sys_num_peers = count_peers();
        stats.packets_total += sys_num_peers * cfg.cycle_stats / cfg.lora_cycle;
        stats.packets_received += sys_pps;
        stats.percent_received = (stats.packets_received > 0) ? constrain(100 * stats.packets_received / stats.packets_total, 0 ,100) : 0;

        // Screen management

        if (!curr.state && !display_enabled) { // Aircraft is disarmed = Turning on the OLED
            display.displayOn();
            display_enabled = 1;
        }

        else if (curr.state && display_enabled) { // Aircraft is armed = Turning off the OLED
            display.displayOff();
            display_enabled = 0;
        }

    stats_updated = now;
    }

}
